In [1]:
import numpy as np
import pandas as pd

In [19]:
# Lets create two series objects
index=[f'i{ind}' for ind in range(10)]
s1 = pd.Series(np.arange(10), index=index)
s2 = pd.Series(np.random.randint(1,100, 10), index=index)

# Also lets create a DF from them
df1 = pd.DataFrame({'s1':s1, 's2':s2})

df1

    s1  s2
i0   0  83
i1   1  49
i2   2  69
i3   3  54
i4   4  69
i5   5  76
i6   6  74
i7   7  95
i8   8  74
i9   9  90

In [20]:
# We can also create the DF from concatinating bot series

df2 = pd.concat([s1, s2])
df2

i0     0
i1     1
i2     2
i3     3
i4     4
i5     5
i6     6
i7     7
i8     8
i9     9
i0    83
i1    49
i2    69
i3    54
i4    69
i5    76
i6    74
i7    95
i8    74
i9    90
dtype: int64

<div class="jumbotron">
<p>Things to observe from above result</p>

- Pandas concatenation preserves indices.
- You can choose to ignore them with verify_integrity=True. This will raise an error
- You can use ignore_index=True if you want to set new indexes for the common indexes.
- You can also mention another argument, keys=['X', 'Y']. Result will be a hierarchically indexed series containing the data.
</div>

In [21]:
df3 = pd.concat([s1, s2], ignore_index=True)
df3

0      0
1      1
2      2
3      3
4      4
5      5
6      6
7      7
8      8
9      9
10    83
11    49
12    69
13    54
14    69
15    76
16    74
17    95
18    74
19    90
dtype: int64

In [23]:
# Adding MultiIndex keys

df4 = pd.concat([s1, s2], keys=['X', 'Y'])
df4

X  i0     0
   i1     1
   i2     2
   i3     3
   i4     4
   i5     5
   i6     6
   i7     7
   i8     8
   i9     9
Y  i0    83
   i1    49
   i2    69
   i3    54
   i4    69
   i5    76
   i6    74
   i7    95
   i8    74
   i9    90
dtype: int64

In [42]:
# Generally, we will get data with different indexes.
# So lets create two series with different indexes.

n = 2
# Lets create two series objects
index_s1 = [f'i{ind}' for ind in range(n)]
index_s2 = [f'i{ind}' for ind in range(n)]
index_s3 = [f'j{ind}' for ind in range(n)]
index_s4 = [f'j{ind}' for ind in range(n)]
s1 = pd.Series(np.arange(n), index=index_s1)
s2 = pd.Series(np.random.randint(1,100, n), index=index_s2)
s3 = pd.Series(np.arange(n), index=index_s3)
s4 = pd.Series(np.random.randint(1,100, n), index=index_s4)
df4 = pd.DataFrame({'s1':s1, 's2':s2})
df4

df5 = pd.DataFrame({'s2':s3, 's3':s4})
df5

# Lets see what happens when we concantenate them.
pd.concat([df4, df5])

     s1  s2    s3
i0  0.0  72   NaN
i1  1.0  52   NaN
j0  NaN   0  16.0
j1  NaN   1  72.0

In [43]:
pd.concat([df4, df5], join='inner')

    s2
i0  72
i1  52
j0   0
j1   1

In [44]:
# There is another approach. You can append to a dataframe. Will produce the same result as concat.

df4.append(df5)

     s1  s2    s3
i0  0.0  72   NaN
i1  1.0  52   NaN
j0  NaN   0  16.0
j1  NaN   1  72.0